
#include <stdint.h>

#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"

#include "kservice.h"

/*************************************************************
 * 
 *      需要屏蔽GPIO端口的相关细节
 *      比如read_pin, write_pin
 *      比如控制接口, 控制初始化的模式: AF复用, 输入, 输出, 模拟
 *      初始化配置: 对于输出有速度, 推挽/开漏, 上拉/下拉
 *      当前是基于STM32F407芯片
 *      如果有其他芯片, 可以继续复用; 这样的话, 还要加一个中断中间层
 * 
 **************************************************************/




/*************************************************************
 * 
 *      这里先简单实现一些映射接口, 不添加复杂的映射层
 *      
 * 
 **************************************************************/


 